{
    "length": 8,
    "0": [
    "Choosing a destination together",
    "Debating budget (luxury vs. budget travel)",
    "One partner wants adventure, the other prefers relaxation",
    "Disagreeing on travel dates due to work schedules",
    "Researching accommodations (hotel vs. Airbnb vs. resort)",
    "Packing conflicts (overpacking vs. forgetting essentials)",
    "Booking flights and seat selection arguments",
    "Deciding on activities vs. free time"
    ],
    "1": [
    "Running late to the airport",
    "Airport security stress (one is calm, the other panics)",
    "Flight delay or cancellation",
    "Arguing over window vs. aisle seat",
    "One gets airsick, the other is fine",
    "Losing luggage upon arrival",
    "Navigating public transport in a foreign country",
    "Getting lost on the way to the hotel"
    ],
    "2": [
    "Checking in and room not meeting expectations",
    "Discovering the hotel has no elevator with heavy luggage",
    "Arguing over unpacking vs. living out of a suitcase",
    "One wants to nap, the other wants to explore immediately",
    "Realizing something important was forgotten (charger, toiletries)",
    "Room has one bed vs. two (unexpected adjustment)",
    "First meal: trying local cuisine vs. finding familiar food",
    "Jet lag causing grumpiness"
    ],
    "3": [
    "One wakes up early, the other sleeps in",
    "Disagreement on itinerary (sightseeing vs. beach day)",
    "Getting lost while exploring",
    "Stopping for too many photos (one gets impatient)",
    "Long lines at attractions testing patience",
    "One loves shopping, the other hates it",
    "Trying a new activity (snorkeling, hiking) and one backs out",
    "Struggling with language barriers"
    ],
    "4": [
    "One is picky, the other wants to try everything",
    "Waiting too long for a table leading to hangry arguments",
    "Splitting the bill vs. treating each other",
    "One eats too slowly, the other finishes quickly",
    "Food poisoning or bad meal ruining the day",
    "Romantic dinner interrupted by loud tourists",
    "Finding out the ‘must-try’ restaurant is closed",
    "Debating tipping customs in a foreign country"
    ],
    "5": [
    "Sudden bad weather ruining plans",
    "Phone dies with no way to navigate",
    "Missing a train/bus/tour due to poor time management",
    "Running into an ex or someone unexpected",
    "Wallet/passport gets stolen",
    "One gets sick or injured",
    "Realizing credit cards don’t work abroad",
    "Arguing over directions back to the hotel"
    ],
    "6": [
    "Sunset walk on the beach",
    "Surprise reservation at a fancy restaurant",
    "Slow dancing at a local bar",
    "Writing postcards to each other",
    "Stargazing in a remote location",
    "Recreating a scene from a favorite movie",
    "Private balcony breakfast in pajamas",
    "Getting matching souvenirs"
    ],
    "7": [
    "Last-minute souvenir shopping panic",
    "Flight home gets rescheduled",
    "Realizing they spent too much money",
    "Arguing over who keeps the hotel key as a keepsake",
    "Going through photos and laughing at memories",
    "One wants to extend the trip, the other is ready to leave",
    "Airport goodbyes (if it’s a long-distance relationship)",
    "Planning the next vacation on the flight back"
    ]
  }